Documents/ОтражениеУдержанногоНДФЛВБухучете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтражениеУдержанногоНДФЛВБухучете</Name>
			<Comment>АПК:93 Представления объекта и списка совпадают с синонимом</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтражениеВБухучетеУдержанныйНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдержанныйНДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНалоговогоОргана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПеречисленияНалога</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтражениеУдержанногоНДФЛВБухучете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ОтражениеУдержанногоНДФЛ";
	КомандаПечати.Представление = НСтр("ru = 'Отражение удержанного НДФЛ в бухучете'");
	КомандаПечати.МенеджерПечати = "Документ.ОтражениеУдержанногоНДФЛВБухучете";
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью            = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ОтражениеУдержанногоНДФЛ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПФ_MXL_ОтражениеУдержанногоНДФЛ",
			НСтр("ru = 'Отражение удержанного НДФЛ в бухучете'"),
			ПечатьОтражениеУдержанногоНДФЛ(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ОтражениеУдержанногоНДФЛВБухучете.ПФ_MXL_ОтражениеУдержанногоНДФЛ");
			
	КонецЕсли;
						
КонецПроцедуры

Функция ПечатьОтражениеУдержанногоНДФЛ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтражениеУдержанногоНДФЛВБухучете_ОтражениеУдержанногоНДФЛ";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтражениеУдержанногоНДФЛВБухучете.ПФ_MXL_ОтражениеУдержанногоНДФЛ");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдержанныйНДФЛ.Ссылка.Организация.НаименованиеПолное КАК НазваниеОрганизации,
	|	УдержанныйНДФЛ.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	УдержанныйНДФЛ.Ссылка.Дата КАК Дата,
	|	УдержанныйНДФЛ.Ссылка.Номер КАК Номер,
	|	УдержанныйНДФЛ.Ссылка КАК Ссылка,
	|	УдержанныйНДФЛ.НомерСтроки КАК НомерСтроки,
	|	УдержанныйНДФЛ.КБК КАК КБК,
	|	УдержанныйНДФЛ.КодНалоговогоОргана КАК КодНалоговогоОргана,
	|	УдержанныйНДФЛ.КодПоОКТМО КАК КодПоОКТМО,
	|	УдержанныйНДФЛ.КПП КАК КПП,
	|	УдержанныйНДФЛ.СрокПеречисленияНалога КАК СрокПеречисленияНалога,
	|	УдержанныйНДФЛ.Сумма КАК Сумма
	|ИЗ
	|	Документ.ОтражениеУдержанногоНДФЛВБухучете.УдержанныйНДФЛ КАК УдержанныйНДФЛ
	|ГДЕ
	|	УдержанныйНДФЛ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	УдержанныйНДФЛ.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	ДанныеШапки = Новый Структура("НазваниеОрганизации,ПериодРегистрации,ДатаДокумента,НомерДокумента");
	ДанныеСтроки = Новый Структура("Номер,КБК,КодНалоговогоОргана,КодПоОКТМО,КПП,СрокПеречисленияНалога,Сумма");
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеШапки.НазваниеОрганизации = Выборка.НазваниеОрганизации;
		ДанныеШапки.ПериодРегистрации 	= Формат(Выборка.ПериодРегистрации,"ДФ='ММMM yyyy'");
		ДанныеШапки.ДатаДокумента 		= Формат(Выборка.Дата, "ДЛФ=D");
		ДанныеШапки.НомерДокумента 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);

		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			ДанныеСтроки.Номер 					= Выборка.НомерСтроки;
			ДанныеСтроки.КБК 					= Выборка.КБК;
			ДанныеСтроки.КодНалоговогоОргана 	= Выборка.КодНалоговогоОргана;
			ДанныеСтроки.КодПоОКТМО 			= Выборка.КодПоОКТМО;
			ДанныеСтроки.КПП 					= Выборка.КПП;
			ДанныеСтроки.СрокПеречисленияНалога = Формат(Выборка.СрокПеречисленияНалога, "ДФ=dd.MM.yyyy");
			ДанныеСтроки.Сумма 					= Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Процедура ПодготовитьДанныеДляЗаполнения(ПараметрыДляЗаполнения, АдресХранилища) Экспорт
	
	УдержанныйНДФЛ = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраНакопления("ОтражениеВБухучетеУдержанныйНДФЛ");
	
	Организация 	 	= ПараметрыДляЗаполнения.Организация;
	ПериодРегистрации 	= ПараметрыДляЗаполнения.ПериодРегистрации;
	ДокументСсылка 		= ПараметрыДляЗаполнения.ДокументСсылка;
	
	ПериодыЗаполнения = ПериодыЗаполнения(ПериодРегистрации);
	УдержанныйНалог = УчетНДФЛ.УдержаноНалогаЗаПериод(Организация, ПериодыЗаполнения.ДатаНачала, ПериодыЗаполнения.ДатаОкончания, Ложь);
	
	РегистрацииИФНС = ОбщегоНазначения.ВыгрузитьКолонку(УдержанныйНалог, "РегистрацияВНалоговомОргане", Истина);
	СвойстваРегистраций = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РегистрацииИФНС,"КодПоОКТМО,КПП,Код");
	
	Для каждого СтрокаТЗ Из УдержанныйНалог Цикл
		НоваяСтрока = УдержанныйНДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		Если ЗначениеЗаполнено(СтрокаТЗ.РегистрацияВНалоговомОргане) Тогда
			РеквизитыРегистрации 	= СвойстваРегистраций[СтрокаТЗ.РегистрацияВНалоговомОргане];
			НоваяСтрока.КодПоОКТМО 	= РеквизитыРегистрации.КодПоОКТМО;
			НоваяСтрока.КПП 		= РеквизитыРегистрации.КПП;
			НоваяСтрока.КодНалоговогоОргана = РеквизитыРегистрации.Код;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗаполнения = Новый Структура("УдержанныйНДФЛ", УдержанныйНДФЛ);
	
	// Таблицы в данных заполнения содержат различные вспомогательные колонки.
	// Приведем структуру таблиц к структуре табличных частей документа.
	ОтражениеЗарплатыВБухучете.ПривестиРезультатыЗаполненияКСтруктуреТаблицДокумента(РезультатЗаполнения, ДокументСсылка);
	
	ОтражениеРасчетовЗарплатыВБухучете.ОтобратьРезультатыЗаполненияТаблицДокумента(РезультатЗаполнения, ПараметрыДляЗаполнения);
	ОтражениеЗарплатыВБухучете.СвернутьДанныеДляОтраженияЗарплатыВБухучете(РезультатЗаполнения, "");
	
	КолонкиСортировки = 
	"КБК,
	|КодНалоговогоОргана,
	|КодПоОКТМО,
	|КПП,
	|СрокПеречисленияНалога,
	|Сумма";
	РезультатЗаполнения.УдержанныйНДФЛ.Сортировать(КолонкиСортировки, Новый СравнениеЗначений);
	
	ПоместитьВоВременноеХранилище(РезультатЗаполнения.УдержанныйНДФЛ, АдресХранилища);
	
КонецПроцедуры

Функция ПериодыЗаполнения(Период) Экспорт

	ПериодыЗаполнения = Новый Структура("ДатаНачала,ДатаОкончания");
	
	Если Период < Дата(2023,1,1) Тогда
		ПериодыЗаполнения.ДатаНачала 	= НачалоМесяца(Период);
		ПериодыЗаполнения.ДатаОкончания = КонецМесяца(Период);
	Иначе
		НомерГода  = Год(Период);
		НомерМесяца = Месяц(Период);
		Если НомерМесяца = 1 Тогда
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца,1);
			ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,22);
		ИначеЕсли НомерМесяца = 12 Тогда
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца-1,23);
			ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,31);
		Иначе
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца-1,23);
			ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,22);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодыЗаполнения;

КонецФункции

#КонецОбласти

#КонецЕсли
